select Занятия.ID_занятия, Группа.Номер_группы
		from Группа Inner join Занятия
		on Группа.Номер_группы=Занятия.ID_занятия
-------------------------------
select Занятия.ID_занятия, Группа.Номер_группы
		from Группа Inner join Занятия
		on Группа.Номер_группы=Занятия.ID_занятия and  Группа.Номер_группы Like '%222%'
-------------------------------------------------------

select t2.ID_занятия, t1.Номер_группы 
		from Группа as t1, Занятия as t2
		where t1.Номер_группы=t2.Номер_группы

select t2.ID_занятия, t1.Номер_группы 
		from Группа as t1, Занятия as t2
		where t1.Номер_группы=t2.Номер_группы and t1.Номер_группы like '%222%'
-------------------------------------------------

select Занятия.ID_занятия, Группа.Номер_группы
		from Группа cross join Занятия
		where Группа.Номер_группы = Занятия.ID_занятия
-----------------------------------------------------
