--11-5а
-- уровень READ COMMITED не допускает неподтвержденного чтения, но при этом возможно неповторяющееся и фантомное чтение. 
		--Две последовательные операции чтения могут получать различные значения, т. к. дополнительные строки, называемые фантомными, 
		--могут добавляться другими транзакциями.
		
		  set transaction isolation level READ COMMITTED   
	begin transaction 
	select PULPIT from PULPIT where PULPIT_NAME = 'Программное обеспечение информационных технологий';
	-------------------------- t1 ------------------ 
	-------------------------- t2 -----------------
	select  case
          when PULPIT = 'ИСИТ' then 'insert  PULPIT'  else ' ' 
end 'результат', PULPIT from PULPIT  where PULPIT_NAME = 'Информационные системы и технологии';
	commit; 