--11-5б
-- уровень READ COMMITED не допускает неподтвержденного чтения, но при этом возможно неповторяющееся и фантомное чтение. 
		--Две последовательные операции чтения могут получать различные значения, т. к. дополнительные строки, называемые фантомными, 
		--могут добавляться другими транзакциями.
	begin transaction 	  
	-------------------------- t1 --------------------
          update PULPIT set PULPIT = 'ПОИТ' 
                                       where PULPIT = 'ПОУТ' 
          rollback; 