--11-6а —ценарий A представл€ет собой €вную транзакцию с уровнем изолированности REPEATABLE READ
--—ценарий A должен демонстрировать, что уровень REAPETABLE READ не допускает неподтвержденного чтени€ и 
--неповтор€ющегос€ чтени€, но при этом возможно фантомное чтение. 
--”ровень изол€ции повтор€ющегос€ чтени€ SQL Server
--Ёто достигаетс€ размещением общих блокировок на все данные, которые считываютс€ каждым оператором в транзакции,
--и все блокировки удерживаютс€ до завершени€ транзакции

	  set transaction isolation level  REPEATABLE READ --фикс неповтор€ющегос€ чтени€ 
	begin transaction 
	select PULPIT from PULPIT where PULPIT_NAME = 'ѕрограммное обеспечение информационных технологий';
	-------------------------- t1 ------------------ 
	-------------------------- t2 -----------------
	select  case
          when PULPIT = '»—»“' then 'insert  PULPIT'  else ' ' 
end 'результат', PULPIT from PULPIT  where PULPIT_NAME = '»нформационные системы и технологии';
	commit; 